cantileverSecondOutlet2WithAlterationToBlockMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       31560;
    }
    outlet1
    {
        type            patch;
        nFaces          20;
        startFace       31600;
    }
    outlet2
    {
        type            patch;
        nFaces          20;
        startFace       31620;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          620;
        startFace       31640;
    }
    cantilever
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          180;
        startFace       32260;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          32000;
        startFace       32440;
    }
)

// ************************************************************************* //
