cantileverSecondOutlet2WithAlterationToBlockMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

// variables
cantHeight 0.5;
cantLength 2.0;
cantDeflect 0.0;

W1 1;
W2 2;
WO1 0.5;
WO1Start 1.5;
WO1End #calc "$WO1Start + $WO1";
WC $cantLength; // responsible for cantilever length
W3 3;

H1 1;
H2 2;
HC1 #calc "$H2 + $cantDeflect"; // responsible for cantilever deflection, the height of the bottom right corner of the cantilever
HC11 #calc "$H2 - (($H2 - $HC1)*($W1)*(1/$WC))";
HC2 #calc "$HC1 + $cantHeight";
HC22 #calc "$H2 + $cantHeight - (($H2 - $HC1)*($WO1Start)*(1/$WC))";
HO2 0.5;
HO2Start 2.75;
HO2End #calc "$HO2Start + $HO2";
H3 #calc "$H2 + $cantHeight";
H4 #calc "$H3 + 1.5";
H5 #calc "$H4 + 1";
D1 1;

// mesh
xcells 40;
ycells 40;
zcells 1;

xcellsOutlet1 #calc "$xcells * $WO1";
xcellsBeforeOut1 #calc "$xcells * $WO1Start";
xcellsBlocksRight #calc "$xcells * ($W3 - $WC)";
ycellsOutlet2 #calc "$ycells * $HO2";
ycellsBelowOut2 #calc "$ycells * ($HO2Start - $H3)";
ycellsAboveOut2 #calc "$ycells * ($H4 - $HO2End)";
ycellsHalf #calc "$ycells * 0.5";


vertices
(
    // back plane
    ($W1 0 0) // vertex 0
    ($W2 0 0) // vertex 1
    ($W2 $H1 0) // vertex 2
    ($W3 $H1 0) // vertex 3
    ($W3 $H2 0) // vertex 4
    ($W3 $H3 0) // vertex 5
    ($W3 $H4 0) // vertex 6
    ($WO1End $H4 0) // vertex 7
    ($WO1End $H5 0) // vertex 8
    ($WO1Start $H5 0) // vertex 9
    ($WO1Start $H4 0) // vertex 10
    (0 $H4 0) // vertex 11
    (0 $HO2End 0) // vertex 12
    (-1 $HO2End 0) // vertex 13
    (-1 $HO2Start 0) // vertex 14
    (0 $HO2Start 0) // vertex 15
    (0 $H3 0) // vertex 16
    (0 $H2 0) // vertex 17
    (0 $H1 0) // vertex 18
    ($W1 $H1 0) // vertex 19
    ($WC $HC1 0) // vertex 20
    ($WC $HC2 0) // vertex 21
    ($WO1Start $HO2Start 0) // vertex 22
    ($WO1Start $HO2End 0) // vertex 23
    
    // front plane
    ($W1 0 $D1) // vertex 24
    ($W2 0 $D1) // vertex 25
    ($W2 $H1 $D1) // vertex 26
    ($W3 $H1 $D1) // vertex 27
    ($W3 $H2 $D1) // vertex 28
    ($W3 $H3 $D1) // vertex 29
    ($W3 $H4 $D1) // vertex 30
    ($WO1End $H4 $D1) // vertex 31
    ($WO1End $H5 $D1) // vertex 32
    ($WO1Start $H5 $D1) // vertex 33
    ($WO1Start $H4 $D1) // vertex 34
    (0 $H4 $D1) // vertex 35
    (0 $HO2End $D1) // vertex 36
    (-1 $HO2End $D1) // vertex 37
    (-1 $HO2Start $D1) // vertex 38
    (0 $HO2Start $D1) // vertex 39
    (0 $H3 $D1) // vertex 40
    (0 $H2 $D1) // vertex 41
    (0 $H1 $D1) // vertex 42
    ($W1 $H1 $D1) // vertex 43
    ($WC $HC1 $D1) // vertex 44
    ($WC $HC2 $D1) // vertex 45
    ($WO1Start $HO2Start $D1) // vertex 46
    ($WO1Start $HO2End $D1) // vertex 47
    
    // extra vertices
    ($WO1Start $HC22 0) // vertex 48
    ($WO1Start $HC22 $D1) // vertex 49
    ($W1 $HC11 0) // vertex 50
    ($W1 $HC11 $D1) // vertex 51
    ($WC $HO2Start 0) // vertex 52
    ($WC $HO2End 0) // vertex 53
    ($W3 $HO2Start 0) // vertex 54
    ($W3 $HO2End 0) // vertex 55
    ($WC $HO2Start $D1) // vertex 56
    ($WC $HO2End $D1) // vertex 57
    ($W3 $HO2Start $D1) // vertex 58
    ($W3 $HO2End $D1) // vertex 59
);

blocks
(
    hex (0 1 2 19 24 25 26 43) ($xcells $ycells $zcells) 
    simpleGrading 
    (
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1 
	1
    ) // block 0
    hex (18 19 50 17 42 43 51 41) ($xcells $ycells $zcells) 
    simpleGrading 
    (
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0.3 0.4 2) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1
    ) // block 1
    hex (19 2 20 50 43 26 44 51) ($xcells $ycells $zcells) 
    simpleGrading 
    ( 
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0.3 0.4 2) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1
    ) // block 2
    hex (2 3 4 20 26 27 28 44) ($xcellsBlocksRight $ycells $zcells) 
    simpleGrading 
    (  
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0.3 0.4 2) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1
    ) // block 3
    hex (20 4 5 21 44 28 29 45) ($xcellsBlocksRight $ycellsHalf $zcells) 
    simpleGrading 
    ( 
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1 
	1
    ) // block 4
    hex (12 23 10 11 36 47 34 35) ($xcellsBeforeOut1 $ycellsAboveOut2 $zcells) 
    simpleGrading 
    (
	((0.3 0.4 4) (0.7 0.6 1) (0 0 0)) 
	((0 0 0) (0.7 0.6 1) (0.3 0.4 0.25)) 
	1
    ) // block 5
    hex (15 22 23 12 39 46 47 36) ($xcellsBeforeOut1 $ycellsOutlet2 $zcells) 
    simpleGrading 
    ( 
	((0.3 0.4 4) (0.7 0.6 1) (0 0 0))  
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1
    ) // block 6
    hex (16 48 22 15 40 49 46 39) ($xcellsBeforeOut1 $ycellsBelowOut2 $zcells) 
    simpleGrading 
    ( 
	((0.3 0.4 4) (0.7 0.6 1) (0 0 0)) 
	((0.3 0.4 2) (0.7 0.6 1) (0 0 0)) 
	1
    ) // block 7 
    hex (23 53 7 10 47 57 31 34) ($xcellsOutlet1 $ycellsAboveOut2 $zcells) 
    simpleGrading 
    ( 
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0 0 0) (0.7 0.6 1) (0.3 0.4 0.25)) 
	1
    ) // block 8
    hex (22 52 53 23 46 56 57 47) ($xcellsOutlet1 $ycellsOutlet2 $zcells) 
    simpleGrading 
    (  
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1
    ) // block 9
    hex (48 21 52 22 49 45 56 46) ($xcellsOutlet1 $ycellsBelowOut2 $zcells) 
    simpleGrading 
    ( 
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0.3 0.4 2) (0.7 0.6 1) (0 0 0)) 
	1
    ) // block 10 
    hex (53 55 6 7 57 59 30 31) ($xcellsBlocksRight $ycellsAboveOut2 $zcells) 
    simpleGrading 
    ( 
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0 0 0) (0.7 0.6 1) (0.3 0.4 0.25)) 
	1
    ) // block 11
    hex (52 54 55 53 56 58 59 57) ($xcellsBlocksRight $ycellsOutlet2 $zcells) 
    simpleGrading 
    (  
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1
    ) // block 12
    hex (21 5 54 52 45 29 58 56) ($xcellsBlocksRight $ycellsBelowOut2 $zcells) 
    simpleGrading 
    (  
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	((0.3 0.4 2) (0.7 0.6 1) (0 0 0)) 
	1
    ) // block 13 
    hex (14 15 12 13 38 39 36 37) ($xcells $ycellsOutlet2 $zcells) 
    simpleGrading 
    (
	1
        ((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1
    ) // block 14
    hex (10 7 8 9 34 31 32 33) ($xcellsOutlet1 $ycells $zcells) 
    simpleGrading 
    ( 
	((0.3 0.4 4) (0.4 0.2 1) (0.3 0.4 0.25)) 
	1 
	1
    ) // block 15
);

edges
(
);

boundary
(
    inlet 
    {
	type patch;
	faces
	(
	    (0 1 25 24)
	);
    }
    outlet1
    {
	type patch;
	faces
	(
	    (8 9 33 32)
	);
    }
    outlet2
    {
	type patch;
	faces
	(
	    (13 14 38 37) 
	);
    }
    walls
    {
	type wall;
	faces
	(
	(0 24 43 19)
	(18 19 43 42)
	(17 18 42 41)
	(15 16 40 39)
	(15 39 38 14)
	(13 37 36 12)
	(11 12 36 35)
	(10 11 35 34)
	(9 10 34 33)
	(8 32 31 7)
	(6 7 31 30)
	(6 30 59 55)
	(55 59 58 54)
	(54 58 29 5)
	(5 29 28 4)
	(4 28 27 3)
	(2 3 27 26)
	(1 2 26 25)
	);
    }
    cantilever
    {
	type wall;
	faces 
	(
	(50 17 41 51)
	(20 50 51 44)
	(21 20 44 45)
	(21 48 49 45)
	(48 16 40 49)
	);
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 19 2 1)
            (18 17 50 19)
            (19 50 20 2)
            (2 20 4 3)
            (20 21 5 4)
	    (16 15 22 48)
	    (15 12 23 22)
	    (12 11 10 23)
	    (48 22 52 21)
	    (22 23 53 52)
	    (23 10 7 53)
            (21 52 54 5)
	    (52 53 55 54)
	    (53 7 6 55)
            (14 13 12 15)
            (10 9 8 7)
            (25 26 43 24)
            (43 51 41 42)
            (26 44 51 43)
            (27 28 44 26)
            (28 29 45 44)
            (49 46 39 40)
            (46 47 36 39)
            (47 34 35 36)
            (49 45 56 46)
	    (46 56 57 47)
	    (47 57 31 34)
            (29 58 56 45)
	    (58 59 57 56)
	    (59 30 31 57)
	    (39 36 37 38)
	    (31 32 33 34)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
